Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Webcomic_7 Fates (KO>EN).tmx
Source language: ko
Languages: en

source: 지켜야 할 소중한 사람이 있다고···.
en: I must protect my loved ones...

source: 아직 2층에···
en: my friend...

source: 아는 사이
en: do they know each other?

source: 인왕산에서 어떤 일이 벌어졌었는지.
en: from what happened back at inwang mountain...

source: 타탓
en: jump

source: 그래서 잘 알아.
en: that’s how I know about it.

source: 저벅
en: step

source: 아, 글쎄 귀먹었어?{j}15억이라니까, 15억.
en: jeez, you heard it right. this one’s 1.5 billion won*. 1.5 billion.{j} *approximately 1.24 million usd.

source: 뭐야?
en: who is that?

source: 저기···
en: you see--

source: 스윽
en: swish

source: 하여튼, 솔직하지 못하다니까.
en: truly, he does not know how to express his feelings.

source: 네가 본 후포라는 자도 그중 하나지.
en: hupo, whom you’ve met the other day, is one of them.

source: 형님, 뭔가 소란스러운 거 같은데요?
en: hey, do you hear that noise?

source: 도대체 이게 뭐야!
en: what on earth is that?!

source: 조금만 기다려줘, 얘들아.
en: wait for me a little more, my friends.

source: 내 인생에 1억을 실제로 보는 날이 올 줄은 몰랐어.
en: I’d never thought there would be a day I’d make this much money... *100 million won is approx. 80,000 USD.

source: 이건 도대체···!
en: what is this...?!

source: 경수야···.
en: hey, kyungsoo...

source: 지지직
en: stab

source: 그, 그게 무슨···!
en: wh-what do you mean...?!

source: 누구 없을꼬~?
en: is there no one, not a single one?

source: 콰아아아아
en: blast

source: 녀석을 먹어서라도 살 수 있다면, 나는···.
en: as long as I could live, even by feeding of him, I would...

source: 한두 마리 정도는!
en: I can manage one or two beom just fine!

source: 꿀꺽
en: gulp

source: 인간들을 모조리 죽이지 않는 한…
en: my hatred will never cease...

source: 아직 살아 있었네?
en: oh, you were still alive.

source: 덜
en: tremble

source: 긁적
en: scratch

source: 쿠우우우
en: lunge

source: GENERADE,HA
en: GRENADE,HA

source: 마지막 권유다.{j}인간을 먹어라, 자후.
en: I’ll ask one last time, zahu. eat a human.{j}

source: 범 사냥 같은 거 해본 적도 없는데···.
en: I’ve never hunted a beom before...

source: 미안···
en: I’m...

source: 촤
en: swish

source: 저 애송이만 없었으면 고가에 팔 수 있었는데!
en: I could’ve sold the item at a high price if it weren’t for that punk!

source: 후웅
en: swing

source: 쿵
en: thump

source: 탓
en: leap

source: 그 일들이 일어난 지 벌써 수개월···
en: many months have passed since my friends died...

source: 어허, 방금 총도 쏜 녀석을 어찌 내려줄꼬!
en: I most certainly cannot free someone who just fired his gun to a person!

source: 긴장하면 할 수 있는 일도 못 한다.
en: being nervous will hinder your performance.

source: 하여간, 그 자식들···.
en: seriously, those punks...

source: 신시 이살 타워
en: yisal tower, sin-si

source: 아, 그러고 보니까 내일 형 생일이잖아?{j}애들이 일 끝나고 파티 하자고 하던데.
en: and it’s also your birthday tomorrow, right? we were thinking of throwing a party after we finish the job.

source: 어서 숨부터 쉬어!
en: take deep breaths!

source: 아니, 그렇잖아!
en: I know, but still!

source: 제 22 화
en: Episode 22

source: 우리가 범과 대치한 지 거의 한 시간이 흘렀는데 아직까지 경찰이나 군대가 움직이질 않다니.
en: we’ve been confronting those beom for almost an hour now, but there’s no sign of the police or army coming to help.

source: 곧장 제 살길을 위해 동족을 팔다니,
en: just look at how you conveniently sell one of your kind for your sake.

source: 현금 수송차 습격은 리스크가 너무 커서 그래.
en: it’s just that robbing an armored truck is too risky.

source: 묘한 기운이···!
en: I sense a strange energy...!

source: 그래, 손가락 걸고 약속할게.
en: yeah, I pinky swear.

source: 기다려!
en: haru,

source: 아···아니!
en: wa-wait, this can’t be!

source: 뉴스에 보도될 정도로 일이 커지고 있어.
en: it’s making headlines in the news.

source: 연인이 범이라니, 그게 무슨 말이야?
en: your girlfriend was a beom? what are you talking about?

source: 살아남은 것만으로도 감사하게 여겨라.
en: consider yourself lucky to make it out of here alive.

source: 젠장.
en: no!

source: 어, 리더님!
en: oh, sir!

source: 특별히 너에게 주지.
en: ...but I’ll let you have him instead.

source: 제 4화
en: Episode 4

source: 슈오오오
en: fwoosh

source: '범'이라고.
en: ...the beoms.

source: 형!{j}약속 못 지켜서 미안해.
en: Do-geon! I’m sorry for backing out on my word.{j}

source: 네가 여기서 살아 나가면 내가 고양이 새끼다!
en: I’ll call myself a kitten if you survive!

source: 엄마···.
en: mom...

source: 각주 설명 추가
en: *10,000 won is about 8 USD.

source: 또 당신들이야?
en: you guys again?

source: 크윽···.
en: argh...

source: 후우···
en: huff

source: 신시를 박살 낼 때 쓰려고 아껴둔 건데···.
en: I was saving this for the destruction of sin-si but...

source: 이 도둑놈들을 보고 싶다고 그러시네?
en: wishes to meet these thieves.

source: 저런 잔챙이와는 차원이 다르게 강한 데다, 인간의 모습으로 변할 수 있는 범이니까.
en: they’re nothing like this weakling. both of them are powerful and can even shapeshift into humans.

source: 찰칵
en: click

source: 너 때문에 범들한테서 내가 무슨 짓을 당한 줄 알아?!
en: do you have any idea what I had to go through because you let them out?!

source: 엇···!
en: huh...?!

source: 범을 잡으러.
en: let us hunt the beoms.

source: 넌 쌍검을 쓰는 거야?
en: so, you use daggers as weapons?

source: 우선 데리고 나가자!
en: let us take him and escape!

source: 찍...
en: squeak

source: 아, 아니야.
en: n-no!

source: 새로운 알림 1개
en: You have 1 new notification.

source: 그러고 보니, 나 어떻게 됐던 거야?
en: I have to ask, what happened to me?

source: ···어?{j}총 맞았다고?
en: wait, what? I got shot?{j}

source: 인간 주제에 꿈 하나는 크구나!
en: a human and his pipe dream!

source: 크큭
en: kekeke

source: 나는···인간이 아닌가?
en: am I... not considered a human?

source: 범···.
en: beom...

source: 이번엔 안 놓쳐.
en: I’m not losing you this time.

source: ···그리하여
en: ...and...

source: 텅
en: bang

source: 일어나지 않았을 일이야···.
en: ...only if I hadn’t set foot in inwang mountain.

source: 또 똑같은 대답이네.
en: same old same old.

source: 그건 내 거야.
en: that’s mine.

source: 하아···
en: huff

source: 휙
en: lift

source: 때때로 부모님이 사무치게 그리워도,
en: there were times I sorely missed them.

source: 꾹
en: press

source: 퍽
en: pow

source: 으, 응.
en: y-yeah.

source: 탕
en: bang

source: 슈아아아
en: flare

source: 이봐, 아저씨.
en: hey, mister.

source: 그 손 다치기 싫으면 손대지 마.
en: keep your hands off unless you want to lose them.

source: 털썩
en: flop

source: 신시병원
en: Sin-si Hospital

source: 개꿈이 아니란다, 아가야.
en: it’s not a dream, my child.

source: 사람을 납치하자고?
en: you want to kidnap someone?

source: 총이 아니니 더 귀한 거지.{j}이런 물건을 어디서 찾을 수나 있을 거 같아?
en: that’s exactly why it's such a rarity. where else do you think you can find this beauty?{j}

source: 턱
en: thud

source: 이 범의 눈썹에는 사람의 전생을 보는 능력이 있다는 것을 알게 되었다.
en: ...and I learned it contained the power to see past lives of other people.

source: 콰콰콰...
en: rumble

source: ···환?!{j}환이잖아?
en: hwan...?! is that you?{j}

source: 어디서 튀어나온 놈이야?!
en: where did that boy come from?

source: 지난달에 입은 상처는 괜찮느냐?
en: how is the injury you got last month?

source: 웅성
en: bustle

source: 어?
en: huh?

source: 화악
en: whap

source: 까각
en: scratch

source: 인간을 처리했다?
en: take out humans?

source: 아악
en: spurt

source: 저벅...
en: step

source: 그리고 리더라고 그만 불러라.
en: and stop calling me sir.

source: 따라란
en: da dum

source: 부축하느라 힘들었을 텐데 편하게 쉬다 가.
en: I’m sure it wasn’t easy carrying me here, so make yourself at home and rest up.

source: 가현아···.
en: gahyeon...

source: 남 탓은 해도 해도 끝이 없어.
en: there’s no end to that kind of blame game.

source: 쾅
en: crash

source: TV에서 그러던데, 범들 때문에 무인 도시가 됐다고···.
en: according to the news, the entire district is deserted because of the beom.

source: 어쩌면 내 동생도 살아있는 채 끌려갔을지도 몰라.
en: maybe my sister was taken alive as well.

source: 허억···.
en: huff

source: 이렇게 식욕이 샘솟는 건 오랜만이야.
en: and it’s been a while since anybody whet my appetite.

source: 난 환이야.
en: my name is hwan...

source: 제 20 화
en: Episode 20

source: 쳇, 굴욕이다.{j}도둑놈들 덕분에 살아남았다는 게···.
en: tsk, how embarrassing that we owe some burglars for our lives.{j}

source: 그리하여 우리의 땅에 평화를!
en: ...and bring peace to our land!

source: 너 무기가···.
en: your weapon is...

source: 이미 다 무너져 가는군···.
en: the building’s already collapsing...

source: ···어?
en: huh...?

source: 저 녀석을 구할 때까지만 버텨다오.
en: ...but please hold still until I save my friend.

source: 아아···!
en: oh...!

source: 뭐···어려울 땐 서로 도울 수도 있지.
en: well... we should help each other when we’re in need.

source: 다들 무사해서 다행이구나.
en: I am relieved to see everyone safe.

source: 네, 맞습니다!
en: yes, it was him!

source: 너도 금방 친구들 곁으로 보내줄 테니까.
en: you’ll join your friends in no time.

source: 파파팟
en: zoom

source: 나와는 상관없는 일인 줄 알았으니까.
en: ...and I thought it had nothing to do with me.

source: 방심하더니 꼴좋군.
en: serves you right for putting your guard down.

source: 너무하단 생각이 들어서 말이지.
en: and you just crossed the line here.

source: 촤악
en: slash

source: 휘릭
en: twirl

source: 쿠오오오
en: boom

source: 이후 난 범의 눈썹으로 여러 사람들을 관찰하기 시작했고
en: since then, I went around observing people with the beom brow...

source: 슥
en: da dun

source: 콰앙
en: boom

source: 형을 거스를 생각은 없지만 이번 일까지는 하고 싶어.
en: I don’t mean to go behind Do-geon’s back, but I really want to do this job.

source: 녀석들, 인테리어 센스가 최악인데?
en: these beom have terrible tastes in home decor.

source: 아직 전쟁은 시작도 하지 않은 게야.
en: the war has not even started yet.

source: 이···이봐!
en: he-hey!

source: 저 새X가 하는 소리 들었어?
en: did you hear what that punk just said?

source: 타앗
en: dash

source: 어서 녀석을 처치하고 밖으로···!
en: let’s finish him quick and get-!

source: 마침 무기상에 들르려던 참이었다.
en: we were about to stop by the exchange market.

source: 나 때문에···
en: it’s all my fault...

source: 덕분에 이렇게 복수도 즐기고, 인간도 마음껏 먹을 수 있으니까.
en: after all, we get to have fun taking our revenge and feast on humans.

source: 긁적...
en: scratch

source: 범들을 순식간에···!
en: he killed that beom in the blink of an eye...!

source: 아.
en: oh no.

source: 추궁한다고 달라질 문제도 아니다.
en: but it’s not like anything will change by putting them into a corner.

source: 네이버에서 보기
en: View in NAVER

source: 균열?
en: a crack?

source: 촤아아아아
en: fwoosh

source: 하필 왜 오늘 이런 일이···.
en: why today of all days...?

source: 너희가 믿어줄지 모르겠지만···
en: I don’t know if you’ll buy this...

source: 꿈도
en: ...and no dreams to achieve.

source: 빙고.
en: bingo.

source: 어렸을 때부터 쭉, 부모님이 없는 삶을 당연하다는 듯 살아왔다.
en: I’ve been used to being an orphan since I was young.

source: 네 아비가 널 데리고 여기서 자주 노래 부르곤 했는데.
en: your father used to take you here and sing.

source: 촤학
en: flash

source: 슈욱
en: swoosh

source: 화아악
en: flash

source: 그 전생 속 인물은 범과 곰이 사는 세상의 영웅,
en: the hero of the world where beom and gom lived...

source: ···범이다.
en: the beom are coming.

source: 꽈악
en: clench

source: 쿠가가가각
en: skiddd

source: 총 맞았는데 벌써 일어나도 괜찮은 거야?
en: are you sure it’s okay to sit up with a gunshot wound to the stomach?

source: ···재밌는 친구들이네.
en: you have an interesting pool of friends...

source: 제 11 화
en: Episode 11

source: 오싹
en: shudder

source: 삐리링
en: ring

source: 여긴···.
en: where am I...?

source: 역시···.
en: I knew it...

source: 얼마 전까지 사람들로 가득한 거리였는데.
en: it used to be jam-packed with people not long ago.

source: 많이 컸구나.{j}옛날에는 요만하니 귀여웠는데.
en: look how much you’ve grown! you used to be this small when you were little.{j}

source: 슈아악
en: swish

source: 응!
en: okay!

source: 쿨럭
en: cough

source: 후우
en: whew

source: 철컥
en: clunk

source: 스으으...
en: da dun

source: 내게 범과 싸울 수 있는 힘도 그녀가 줬고,
en: she gave me the power to fight against the beom.

source: ···이런!
en: shoot...!

source: 쩌억
en: agape

source: 이쪽 통로에 엘리베이터가 있어요!
en: there’s an elevator down this pass!

source: 그런데 행운인지 불운인지
en: as luck would have it,

source: 역시 쓰레기 같은 종족이야.
en: I knew your tribe was nothing but scum.

source: 범들이 사람을 납치하는 걸 내 눈으로 똑똑히 봤어.
en: I saw the beom kidnapping people with my own eyes.

source: 끄에헤헤헤헤!
en: hehehehe!

source: 주륵
en: drip

source: 콰쾅쾅
en: crash

source: 호신용 단검이라도 있어 다행이군.
en: good that I at least have these daggers for self defense.

source: 과격한 놈들이니 다음부턴 엮이지 않도록 조심해 둬.
en: they’re a violent group, so be sure not to get involved with them.

source: 하하하.
en: hahaha

source: 이쪽이야!
en: this way!

source: 그럼 3억이 적당하지 않겠어요?
en: I say 300 million is a fair price for that, don’t you agree?

source: 아아···!{j}이거 네 동생들이야?
en: oh...! are these your friends?{j}

source: 크윽···!
en: ugh...!

source: 도둑놈들 덕분에 겨우 빠져나왔네.
en: we barely made it out thanks to those thieves.

source: 하이.
en: hi.

source: 형!
en: Dogeon!

source: 하지만 최근 실종 현장에는 발자국만 발견될 뿐, 아무런 흔적도 없습니다.
en: we found nothing but pawprints at the scenes of the recent cases.

source: 어디로?
en: where to?

source: 제하야, 괜찮느냐?
en: zeha, are you all right?!

source: 설마.
en: that guy...

source: 너도 범이라면 알아서 피하라고.
en: you’re a beom. just dodge it.

source: 키잉
en: grrr

source: 킁
en: sniff

source: 뭐야···?{j}순식간에 일곱이나···?!
en: what...? did he just kill seven of us in the blink of an eye?{j}

source: 이런 긁힌 상처로 죽을 리 없잖아.
en: no one dies from a light scratch like this.

source: 인간이 싫을 거예요.{j}그렇죠?
en: you must resent humans, don’t you?{j}

source: 구, 구급차 좀 불러줘요!
en: s-someone call an ambulance!

source: 사, 사기라니!
en: s-swindle you?!

source: 그럼 봐줄게.
en: go when I’m being nice.

source: 그래, 자후 녀석 때문에 던져 놓은 고기가 아직 남아 있었군.
en: ah, I see that the meat I gave zahu is still alive and breathing.

source: 그렇게 현재
en: which brings back to now...

source: 것 봐라, 범이 아니잖느냐.
en: do you see? he is not a beom.

source: 범.
en: he is that beom.

source: 경태야.
en: gyeongtae.

source: 그 답답함을 호소할 곳을 필요로 하고 있었다.
en: people needed someone to vent on.

source: 주군, 그게 무슨···.
en: what do you mean, master...?

source: 구 발견...
en: bodies found...

source: 제 14 화
en: Episode 14

source: 찌직
en: squeak

source: 내 이름은 세인.
en: my name is cein.

source: 끄윽
en: grit

source: 까가가각
en: screee

source: 맞췄다・・・!
en: I got it!

source: 우리도 서둘러 탈출하자.
en: let’s hurry out of here.

source: 이젠 지킬 약속도
en: now, I have no promises to keep...

source: ···불티 그놈의 울음소린가?
en: was that cry... bulti?

source: 도와줄게, 내 등에 올려줘.
en: here, I’ll help. get him on my back.

source: 실종 사건이라면 호환을 말씀하시는 건가요?
en: do you mean the beom attacks?

source: …조금만 기다려줘.
en: just you wait...

source: 이쪽은 저희에게 맡기고 피하세요.
en: we’ll take it from here. get to safety.

source: 우선 몸을 숨겨야겠어.
en: I should go into hiding for now.

source: 서둘러 오시게.
en: come quickly.

source: 오시게···오시게.
en: come... come.

source: 나···
en: am I...

source: 착각하지 마.
en: don’t get me wrong, though.

source: 끼이익
en: screech

source: 나는 수호신으로서 범들이 나오지 못하게 입구를 지키고 있었단다.
en: I am a deity who guards the entrance, preventing the beoms from escaping.

source: 그건 우리 거다.
en: it belongs to us.

source: 이 녀석들입니다.
en: they are the ones...

source: 내가 선봉에 서죠.
en: I'll lead in the front.

source: 아주 간단한 일이야.
en: it’s simple like that.

source: 스으으···
en: da dun

source: 곧바로 죽이거나 하지 않을 테니까.
en: we won’t kill you right away.

source: 내 놀이터를 망친 게 네놈들이지?
en: you are the ones who messed up my playground, aren’t you?

source: 범과 다른 종족의 불화는 커져만 갔지.
en: and conflict between the beom tribe and the others worsened.

source: 슈우우우
en: whoosh

source: 꾸욱
en: wince

source: 스으・・・
en: swipe

source: 의문의 살인 사건이 일어나는 도심에서 공포에 떨고 있는 시민들은
en: terrorized by the series of mysterious murders in the city,

source: 저걸 얻어야 해.
en: we need to have that.

source: ···난 전생을 통해 후포라는 자를 알고 있어!
en: I’ve known this beom from my past life!

source: 꺄아아아악
en: ahhhh!!

source: 이제는 틀렸다 싶을 때 눈앞에 새하얀 빛이 보였고,
en: just as I thought this was it for me, a bright light flashed before my eyes.

source: 타타탕
en: bratata

source: 허억
en: huff

source: 고오오오오
en: da dun

source: 만원
en: 10,000 won

source: 아무리 그래도 사기를 치면 안 되죠.
en: that’s no reason for you to pull a scam.

source: 오전 07:49
en: 07:49 AM

source: 일 년에 딱 한 번, 그림자 세계의 봉인을 열고 찾아온 범들이
en: once a year, the beoms break through the seal to the world of shadows.

source: 그곳에 네 부모의 진실이 있을 테니.
en: the truth to your parents will be waiting for you.

source: 그날 온 손님들에게 있으렸다.
en: all of them were caused by the visitors who came over that day.

source: 너 이 자식!
en: oh, come on!

source: 호랑나비다!
en: it’s the tiger butterfly!

source: 널 위해 준비한 특별한 인간이지.
en: I prepared him especially for you.

source: 붕괴 속도가 더 빨라진다!{j}서두르자!
en: it’s collapsing faster by the minute! let’s hurry!{j}

source: 인간이 싫을 거예요.
en: I suppose you must resent humans,

source: 검이 제멋대로 움직였어?!
en: the sword just brandished around on its own!

source: 제하야.
en: zeha.

source: 정말 모든 게 전생에 의한 윤회라면···.
en: if everything that’s happening right now is really a repeat of the past life...

source: 이건 영락없이 범이잖아?
en: but he’s just like a beom!

source: 뭐···?
en: seriously?

source: 그럼 난 먼저 가볼게.
en: I’ll get going then.

source: 잠시만요.
en: one second.

source: 뭉게
en: whoosh

source: 동생도 범한테 납치당해서···
en: they even kidnapped my sister...

source: 이렇게 될 줄 알았으면 좀 더 함께 시간을 보낼걸.
en: I would’ve spent more time with you if I had known things would turn out this way.

source: 후우...
en: phew

source: 이번 거는 좀 먹혔겠지?
en: I hope it worked this time.

source: 크크, 도심에 이렇게 쉽게 침입할 수 있다니.
en: hahaha, look how easy it is to break into the city.

source: 환웅 대표님, 무사하셨군요!
en: chairman, I’m glad you’re okay!

source: 슉
en: swish

source: 총감님 생각은 어떠신가요?
en: what’s your thoughts on that, commissioner?

source: 어드메냐・・・.
en: ...who aren’t here yet?

source: 콰작
en: crunch

source: 하는 수 없지.
en: you give me no choice.

source: 정체도 모르는 걸 잡을 수나 있나?
en: I know, right? how can anyone catch something we know nothing about?

source: 이해할 수 없어.
en: I can’t understand him.

source: 나쁜 짓은 그만 두자고···
en: I should have told you to put a stop to this shady life...

source: 이거나 먹어라.
en: take that.

source: 가지 말라고 했건만···!
en: I told them not to go!

source: 크아아아아
en: growr

source: 여긴 신시가지 안전 구역이잖아?
en: this is the safe zone of sinsi’s new district.

source: 그런 물건을 15억이나 받고 파는 건 좀 아니죠.
en: you’re way out of line here to receive 1.5 billion for that.

source: 범 사냥꾼이랍시고 무기 조달해서 강도 짓, 도둑질까지 하는 놈들이 얼마나 많은데.
en: you have no idea how many thieves are out there stealing and robbing others with the weapons they bought by pretending to be beom hunters.

source: (주)내일 익스프레스
en: Tomorrow Express Inc.

source: 저 사람, 뭘 들고 있는 거지···?
en: what is that guy holding?

source: 어···으, 응.
en: uhm... y-yeah.

source: 으아아아악
en: aaahhhhh

source: 방금 말한 그 두 범은 조심하는 게 좋을 거야.
en: you better watch out for the two beom I just mentioned.

source: 씨익
en: smirk

source: 남의 것을 탐내면 안 되지.
en: not so soon, you bunch of thieves.

source: 그런 지옥 같은 광경을 보면서···
en: how I wished to die...

source: 네 동생이 그런 모습을 보면 실망할 거다!!!
en: that’s not what your sister would want! she’d be disappointed in you!!!

source: 이 자식은 여기서 반드시 죽인다.
en: I’m not leaving here until I kill him.

source: 4천 년 전 마무리 짓지 못한 전쟁을
en: we shall resume this war...

source: 크르르르
en: grrrr

source: 이봐, 자후.
en: hey, zahu.

source: 슈악
en: fwish

source: 으득...
en: grit

source: 그렇다면 왜 네가 멀쩡히 존재하는데도 범이 세상에서 활개를 치고 있는 건데?
en: if that’s who you are, then why are the beoms still at large?

source: 저 범들은 하급 범.
en: they’re low-grade beom.

source: 먹고 말해···.
en: don’t talk when you have food in your mouth...

source: 제 15 화
en: Episode 15

source: 생계를 위한 아르바이트의 반복.
en: while trying to survive the daily grind of part-time jobs...

source: 불티 님?{j}마로 님?
en: bulti? maro?{j}

source: 내가 왜 병원에 있지?
en: what am I doing in a hospital?

source: 치지직···
en: sizzle

source: 제 19 화
en: Episode 19

source: 소화전이었잖아?
en: I thought I saw something else.

source: 카앙
en: clang

source: 쿠궁
en: crash

source: 이게 살을 베는 감촉인가?
en: so this is what it feels like to cut through flesh.

source: 그래, 그날 이후 저것과 비교도 할 수 없는 범들이 세간에 나와 있다.
en: but, yes. ever since that day, lots of beoms came to this world, with many much more powerful and faster than the one you just fought.

source: 따라가 봐야겠어···!
en: I must follow them!

source: 공동기획 HYBE | NAVER WEBTOON
en: Co-Planning HYBE / NAVER WEBTOON

source: 한 방에 죽지 마라.
en: I really hope this doesn’t kill you.

source: 절레
en: shake

source: 제법이군, 창술사 녀석.
en: impressive, spearman. I’ll give you that.

source: 난 주안이야.
en: I’m jooan.

source: 죄가 없긴 왜 없어!!
en: that’s bull!!

source: 젠장, 너무 빨라!
en: shoot, it’s too fast!

source: 덕분에 살았다!
en: true, but we’ll live thanks to them!

source: 너무 자연스럽게 있어서 그냥 넘어갈 뻔했네.
en: I got so used to having him around that I almost forgot.

source: 뭔가 낌새가 이상해···.
en: something’s wrong...

source: 그런데 언제까지 숨어만 있을 거냐?
en: but how long are you going to play hide-and-seek with me?

source: 애들이 일 끝나고 파티 하자고 하던데.
en: we were thinking of throwing a party after the job.

source: 저 혼자 처리할 수 있다고요!
en: I have this under control

source: 총구를 겨눈 사과의 의미로 한 가지 알려주지.
en: then let me give you a tip as a token of apology for holding you at gunpoint.

source: 그리고 범바위 근처에서・・・.
en: and near this rock...

source: 한국은행
en: Bank of Korea

source: 안녕하십니까!
en: how are you doing?

source: 한번 들어보시겠어요?
en: would you like to hear it?

source: 자후한테.
en: to meet zahu.

source: 그나저나 굉장하던데?
en: by the way, you were amazing back there...

source: 저곳을 향하면 살 수 있을까 싶어 필사적으로 손을 뻗는 순간,
en: I desperately reached for it in the hopes of making it out alive.

source: 후두둑
en: splatter

source: 3억.
en: make that 300 million won*.

source: 너희들이 호랑나비 중에서도 덜떨어졌다는 건 잘 알겠네.
en: I don’t know who you all are, but I can see that you’re the fools in the team.

source: 줄 수 있는 게 이것밖에 없어.
en: this is all I have got.

source: 어쩌면···
en: perhaps...

source: 불티?!
en: bulti?!

source: 불티 그놈도 여기 없는 모양이야.
en: looks like bulti’s not here either.

source: 나를 먹지 않을 셈인가···?
en: is he not going to eat me...?

source: 호랑나비 대표 '동철'이 오늘 시민들 앞에서 공개 사과를 올렸다.
en: The leader of the Tiger Butterfly, Dongcheol, publicly apologized to the people today.

source: 어이, 형씨.{j}움직이면 저 자식 진짜로 죽어.
en: hey, man. take another step and that punk is done for.{j}

source: 불티는 내 연인을 죽인 범의 이름이야.
en: bulti killed my girlfriend.

source: 혼자 다니는 것 같지만 호랑나비의 이름을 앞세워도 개의치 않고 방아쇠를 당길 놈이야.
en: he wouldn’t hesitate to pull the trigger even if I threaten him with the tiger butterfly name.

source: 쿠르릉...
en: rumble

source: 꺄아아아!
en: aaaahhhh!

source: 다음에는 더 좋은 자리를 마련하도록 하죠.
en: I’ll make sure our next meal together is even better.

source: 도망치세요!
en: everybody run!!!

source: 이거 네 동생들이야?
en: I suppose these dolls were your friends, eh?

source: 콱
en: fwoosh

source: 쳇.
en: tsk.

source: 슈화악
en: whiz

source: 쿠확
en: stab

source: 우웨에엑
en: blergh

source: 척
en: click

source: 1억으로도 이 정도 수준의 검밖에···.
en: true... this shoddy sword was the best one I could get with a 100 million won...

source: 음?
en: hm?

source: 치리릭
en: fizzle

source: 시멘트
en: cement

source: 나도 그 광경을 보긱 전까진 너희들이랑 똑같이 생각했어.
en: I thought the same until I saw it happen with my own eyes.

source: 크크큭.
en: kekeke

source: 덕기, 머리 챙겨라.
en: deok-ki, get the head.

source: 근데 운반하시는 품목이 어떻게 되십니까?
en: one more thing. what kind of products do you deliver?

source: 아주머니는 암행어사인가?
en: was she an undercover royal inspector?

source: 도와줘서 고마워.
en: thanks for helping us.

source: 왜 이렇게 늦었어?
en: what took you so long?

source: 누구지?
en: who is he?

source: 톡
en: tap

source: 파바밧
en: whoosh

source: 원피스다!
en: it’s a dress!

source: 저 범은 왜 나한테 자신의 피를···.
en: why is the beom feeding me his blood...?

source: 많이 무서웠을 텐데···.
en: it must’ve been terrifying...

source: 모든 게 내가 인왕산에 가지 않았다면
en: all this could’ve been prevented...

source: 내버려 둬, 이런 데서 만나는 것 보면 금방 죽을 팔자야.
en: leave him be. judging from the way he hunts, his number is up.

source: 투쾅
en: zoom

source: 그런데 방금 그건・・・
en: that flash just now...

source: 숨이 제대로 안 쉬어져!
en: I can’t breathe properly!

source: 어?!{j}선물?
en: huh?! a present?{j}

source: 겨··· 경수 형?
en: k-kyungsoo...?

source: 이 같은 끔찍한 범죄가 일어나는 상황에 사회적 책임을 통감합니다.
en: as a chairman of such a group, I feel deeply responsible for the terrible crimes happening today.

source: 위용
en: weewoo

source: 아직 오지 않은 이는
en: where are those...

source: 쿠웅
en: crash

source: 물러서지 마!
en: stand your ground!

source: 아···!{j}정말 그렇네.
en: oh, you’re right...!{j}

source: 무슨 일 있나?
en: is something wrong?

source: 이런, 이런···.{j}갑자기 공격이라니.
en: my, my... to attack so suddenly...{j}

source: 에잉, 그래 봐야 검 하나 사기 힘든 돈 아니냐.
en: hmph. it is still not half enough to procure a decent sword.

source: 촥
en: slide

source: 뭐야, 아저씨.{j}우리한테 사기 치려고 했던 거야?
en: wow, mister. were you trying to rip us off?{j}

source: 무・・・무슨 일이야?!
en: wh-what happened?

source: 그 범이 날 씹지 않고 삼킨 덕분에 범의 배 속에서 몇 날 며칠을 있었다.
en: that beom devoured me in one gulp, trapping me alive in his stomach for days.

source: 경태냐, 오랜만이네.
en: it’s been a while, kyeongtae.

source: 보통 인간들의 무기가 아니잖아!
en: it’s nothing like the other weapons humans use!

source: 저 아저씨, 범 사냥꾼 상대로 사기를 치려 하다니 배짱 좋은걸?
en: scamming beom hunters? I must say, he’s got guts.
